export default {
  projections: {
    ДирПерсоналаE: {
      код: {
        __caption__: 'Код директора'
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    },
    ДирПерсоналаL: {
      код: {
        __caption__: 'Код директора'
      },
      сотрудники: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    }
  },
  validations: {
    код: {
      __caption__: 'Код директора'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    }
  }
};
