export default {
  projections: {
    СогласиеE: {
      номерДок: {
        __caption__: 'Номер документа'
      },
      дата: {
        __caption__: 'Дата составления'
      },
      подписано: {
        __caption__: 'Подписано'
      },
      отправлено: {
        __caption__: 'Отправлено'
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      дирПерсонала: {
        __caption__: 'Директор по персоналу',
        код: {
          __caption__: 'Код'
        }
      }
    },
    СогласиеL: {
      номерДок: {
        __caption__: 'Номер документа'
      },
      дата: {
        __caption__: 'Дата составления'
      },
      подписано: {
        __caption__: 'Подписано'
      },
      отправлено: {
        __caption__: 'Отправлено'
      },
      сотрудники: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      дирПерсонала: {
        __caption__: 'Код',
        код: {
          __caption__: 'Код'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата составления'
    },
    номерДок: {
      __caption__: 'Номер документа'
    },
    отправлено: {
      __caption__: 'Отправлено'
    },
    подписано: {
      __caption__: 'Подписано'
    },
    дирПерсонала: {
      __caption__: 'Директор по персоналу'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    }
  }
};
