export default {
  projections: {
    ГрафикиОтпускаE: {
      номерДок: {
        __caption__: 'Номер док'
      },
      дата: {
        __caption__: 'Дата'
      },
      отправлено: {
        __caption__: 'Отправлено'
      },
      датаНач: {
        __caption__: 'Дата нач'
      },
      колДней: {
        __caption__: 'Кол дней'
      },
      дирПерсонала: {
        __caption__: 'Дир персонала',
        код: {
          __caption__: 'Код'
        }
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    },
    ГрафикиОтпускаL: {
      номерДок: {
        __caption__: 'Номер док'
      },
      дата: {
        __caption__: 'Дата'
      },
      отправлено: {
        __caption__: 'Отправлено'
      },
      датаНач: {
        __caption__: 'Дата нач'
      },
      колДней: {
        __caption__: 'Кол дней'
      },
      дирПерсонала: {
        __caption__: 'Код',
        код: {
          __caption__: 'Код'
        }
      },
      сотрудники: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    датаНач: {
      __caption__: 'Дата нач'
    },
    колДней: {
      __caption__: 'Кол дней'
    },
    номерДок: {
      __caption__: 'Номер док'
    },
    отправлено: {
      __caption__: 'Отправлено'
    },
    дирПерсонала: {
      __caption__: 'Дир персонала'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    }
  }
};
